src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ВидНоменклатуры</name>
    <type>
      <types>EnumRef.ВидНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКухни</name>
    <type>
      <types>CatalogRef.ВидыКухни</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЗаказов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Enums/ВидНоменклатуры/ВидНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидНоменклатуры</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
  <enumValues>
    <name>ДоставкаЗаказов</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Номенклатура/Forms/ФормаЭлемента/Module.bsl
//#Область ОписаниеПеременных
//
//#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СкрытьПоказатьЭлементы();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидНоменклатурыПриИзменении(Элемент)
	
	СкрытьПоказатьЭлементы();

КонецПроцедуры

#КонецОбласти

//#Область ОбработчикиКомандФормы
//
//#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СкрытьПоказатьЭлементы()
	
	ЭтоНоменклатураТовар = (Объект.ВидНоменклатуры = Перечисления.ВидНоменклатуры.Товар);
	
	Элементы.ВидКухни.Видимость = ЭтоНоменклатураТовар;
	Элементы.КоличествоЗаказов.Видимость = ЭтоНоменклатураТовар;
	
КонецПроцедуры

#КонецОбласти
